#pragma once
//以下内容是网上常见的一些Codec的CLSID

/***************************************** lame-3.99.5 Begin ************************************/
// {b8d27088-df5f-4b7c-98dc-0e91a1696286}
OUR_GUID_ENTRY(CLSID_LAMEDShowFilter,
	0xb8d27088, 0xff5f, 0x4b7c, 0x98, 0xdc, 0x0e, 0x91, 0xa1, 0x69, 0x62, 0x86)
/******************************************* lame-3.99.5 End ************************************/


/************************************** Codec & Format Begin ************************************/
//  MainConcpet 中定义的
//	8D2D71CB-243F-45E3-B2D8-5FD7967EC09B
//  为什么系统中已经有 MEDIASUBTYPE_H264，这里还要定义这个不一样的?
OUR_GUID_ENTRY(CLSID_H264FileFormat,
	0x8d2d71cb, 0x243f, 0x45e3, 0xb2, 0xd8, 0x5f, 0xd7, 0x96, 0x7e, 0xc0, 0x9b)

//  31435641-0000-0010-8000-00AA00389B71
OUR_GUID_ENTRY(CLSID_H264_AVC1,
	0x31435641, 0x0000, 0x0010, 0x80, 0x00, 0x00, 0xAA, 0x00, 0x38, 0x9B, 0x71)

//  30313276-0000-0010-8000-00aa00389b71
OUR_GUID_ENTRY(CLSID_v210,
	0x30313276, 0x0000, 0x0010, 0x80, 0x00, 0x00, 0xaa, 0x00, 0x38, 0x9b, 0x71)

/*************************************** Codec & Format End *************************************/
