package com.thirdPart.test;

/***********************************************************************************************************************************************
* http://blog.csdn.net/jationxiaozi/article/details/8509732
* 
* Ehcache -- 广泛用于大型复杂分布式web application的各个节点
*    使用java开发，开源的、设计于提高在数据从RDBMS中取出来的高花费、高延迟采取的一种缓存方案  
**********************************************************************************************************************************************/


public class EhcacheTest {

}
