package com.thirdPart.test;

/**********************************************************************************************************************************************
 * Nginx(http://nginx.org)
 *   高性能的，轻量级的HTTP Web 服务器 和 反向代理服务器及电子邮件 IMAP/POP3/SMTP 代理服务器
 *   等价于 Apache +
 * 
 * Windows下运行: 直接双击运行(会阻塞当前运行进程?) 或 start nginx, 然后 http://127.0.0.1/ 访问即可
 * 交互: nginx -s 命令。 如 stop(停止), reload(重新加载配置), quit(退出程序)
 * TODO: 帮助？
 * 
 * 配置:
 *   nginx.conf
 * 
**********************************************************************************************************************************************/

public class NginxTest {

}
