package com.fishjam.storeserver.study;

/**************************************************************************************************************************************
 * Android sqlite数据库操作通用框架AHibernate(一)-CRUD示例和使用步骤
 *   http://blog.csdn.net/lk_blog/article/details/7455992
 * 
 * Hibernate -- 开源的对象关系映射框架，对JDBC进行了非常轻量级的对象封装，可以使用对象编程思维来操纵数据库。
 *   可以应用在任何使用JDBC的场合。甚至可以在应用EJB的J2EE架构中取代CMP，完成数据持久化的重任。
 * 优点：
 *   1.对JDBC访问数据库的代码做了封装，大大简化了数据访问层繁琐的重复性代码
 *   2.是一个优秀的ORM实现。大大简化了DAO层的编码工作 ，使开发更对象化
 *   3.移植性好，支持各种数据库，如果换个数据库只要在配置文件中变换配置就可以了，不用改变hibernate代码
 *   4.支持透明持久化，因为hibernate操作的是纯粹的（pojo）java类，没有实现任何接口，没有侵入性
**************************************************************************************************************************************/

/**************************************************************************************************************************************
 * hibernate.cfg.xml 
 *   <mapping resource="com/xxx/User.hbm.xml"
***************************************************************************************************************************************/

/**************************************************************************************************************************************
 * Configuration
 *   buildSessionFactory()
 * Criteria
 * Query
 * Session
 *   beginTransaction()
 *   getTransaction().commit()
 * SessionFactory
 *   openSession()
 * Transaction
**************************************************************************************************************************************/
public class HibernateStudy {

}
