package com.fishjam.storeserver.study;

/**************************************************************************************************************************************
 * Spring -- 基于IoC和AOP的构架多层j2ee系统的框架，对不同的数据访问技术提供了统一的接口
 *   其真正的精华是 Ioc模式 实现的BeanFactory和 AOP 
 * 
 * Ioc(Inversion of Control) -- 反向控制
 *
 * 缺点：
 *   1.使用人数不多、jsp中要写很多代码、控制器过于灵活，缺少一个公用控制器
**************************************************************************************************************************************/

public class SpringStudy {

}
