package com.fishjam.storeserver.study;

/**************************************************************************************************************************************
 * Spring -- 基于IoC和AOP的构架多层j2ee系统的开发应用框架，用于简化企业级应用程序开发。
 *   1.通过配置文件来创建对象，管理对象之间依赖关系(不用修改源码或重新编译)
 *   2.还提供 通用日志记录、性能统计、安全控制、异常处理等面向切面的能力
 *   3.管理 数据库事务，供了一套简单的JDBC访问实现，对不同的数据访问技术提供了统一的接口。也可与第三方数据访问框架(如Hibernate)集成
 *   其真正的精华是 Ioc模式 实现的BeanFactory和 AOP 
 * 
 * Ioc(Inversion of Control) -- 反向控制
 *
 * 缺点：
 *   1.使用人数不多、jsp中要写很多代码、控制器过于灵活，缺少一个公用控制器
 *
**************************************************************************************************************************************/
/**************************************************************************************************************************************
 * applicationContext.xml -- Bean工厂配置文件，ApplicationContext extends BeanFactory
**************************************************************************************************************************************/

public class SpringStudy {

}
