package com.fishjam.study;

/**************************************************************************************************************************************
 * Maven -- 基于项目对象模型(Project Object Model, POM)的项目管理工具，可以通过一小段描述信息来管理项目的构建，报告和文档。
 *   配置文件：基于 Jelly 的可执行 XML
 *     project.xml 
 *     maven.xml
 *   命令: mvn
**************************************************************************************************************************************/


public class MavenStudy {

}
