#pragma once

/*****************************************************************************************************
* EA -- ( More Tools -> Extended -> Data Modeling )
*   注意：加入表以后，必须先在属性页中选择"Database"，才能在加入字段时选择类型
* 
* 生成数据库反向工程：右键中 "Import DB schema from ODBC" ->
*****************************************************************************************************/


/*****************************************************************************************************
* PowerDesigner
*   包含六个紧密集成的模块，允许个人和开发组的成员以合算的方式最好地满足他们的需要。这六个模块是：
*     ProcessAnalyst --     用于数据发现，创建功能模型和数据流图，创建"处理层次关系"。 
*     DataArchitect --      用于双层，交互式的数据库设计和构造，利用实体-关系图
*     AppModeler --         用于物理建模和应用对象及数据敏感组件的生成。 
*     MetaWorks --          用于高级的团队开发，信息的共享和模型的管理。 
*     WarehouseArchitect -- 用于数据仓库的设计和实现。 
*     Viewer --             用于以只读的、图形化方式访问整个企业的模型信息。
*****************************************************************************************************/
